# DepthParamId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeMultiplanarDefinition..::..DepthParamId Property
RebarShapeMultiplanarDefinition Class See Also
---
Id of the parameter driving the multiplanar depth. The depth is measured center-to-center of the bar. A valid shape parameter must be assigned to DepthParamId before the MultiplanarDefinition can be used in RebarShape creation.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ElementId DepthParamId { get; set; }
```

Visual Basic
---
```text
Public Property DepthParamId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ DepthParamId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
RebarShapeMultiplanarDefinition Class
Autodesk.Revit.DB.Structure Namespace